---
kind: enumMember
id: F:Autodesk.Revit.UI.Selection.ObjectSnapTypes.Endpoints
enum: Autodesk.Revit.UI.Selection.ObjectSnapTypes
source: html/806b68f7-9801-f58e-ee3e-94b85bfaea8f.htm
---
# Autodesk.Revit.UI.Selection.ObjectSnapTypes.Endpoints

Snaps to the endpoint of an element or component.